In [7]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

%matplotlib inline

In [8]:
import os

In [9]:
DATA_PATH = "/Users/annakotlova/Documents/names/"

In [10]:
def count_top3(years):
    return ['John', 'William', 'Mary']
names = pd.read_csv(
    DATA_PATH + 'yob1880.txt', 
    names=['Name','Gender','Count']
)
names.sort_values(by='Count', ascending=False).head(3)

        Name Gender  Count
942     John      M   9655
943  William      M   9532
0       Mary      F   7065

In [11]:
cols = ['Name','Gender','Count']
names_1900 = pd.read_csv(DATA_PATH + 'yob1900.txt', names=cols)
names_1950 = pd.read_csv(DATA_PATH + 'yob1950.txt', names=cols)
names_2000 = pd.read_csv(DATA_PATH + 'yob2000.txt', names=cols)
names_1900_1950 = pd.merge(names_1900, names_1950, on=['Name', 'Gender'], suffixes=('_1900', '_1950'))
names_1900_1950_2000 = pd.merge(names_1900_1950, names_2000, on=['Name', 'Gender'])
names_1900_1950_2000.sort_values(by='Count', ascending=False).head(3)

         Name Gender  Count_1900  Count_1950  Count
1244    Jacob      M         233         465  34470
1194  Michael      M         495       65166  32033
1305  Matthew      M         130        1304  28572

In [12]:
names_all = pd.concat([names_1900, names_1950, names_2000], names=['Gender', 'Pos'])
names_all.sort_values(by='Count', ascending=False).head(3)

        Name Gender  Count
6113   James      M  86238
6114  Robert      M  83575
0      Linda      F  80439

In [13]:
cols = ['Name','Gender','Count']
names_1900 = pd.read_csv(DATA_PATH + 'yob1900.txt', names=cols)
names_1950 = pd.read_csv(DATA_PATH + 'yob1950.txt', names=cols)
names_2000 = pd.read_csv(DATA_PATH + 'yob2000.txt', names=cols)
names_1900_1950 = pd.merge(names_1900, names_1950, on=['Name', 'Gender'], suffixes=('_1900', '_1950'))
names_1900_1950_2000 = pd.merge(names_1900_1950, names_2000, on=['Name', 'Gender'])
names_1900_1950_2000.groupby('Gender').sum()

        Count_1900  Count_1950    Count
Gender
F           279397     1389147   670233
M           146387     1674575  1262400